{
  "mostrar-info": "MORE INFO",
  "abrir": "OPEN",
  "title-social": "My Social Info",
  "conhecimento": "Knowledge",
  "title-conhecimento": "Knowledge in {{title}}!",
  "geral": "General",
  "banco-dados":"Data Base",
  "servidor": "Server",
  "github-describe": "Here is a list of all my public projects! <br> The biggest motivation to use gitHub was because of the versioning,<br> but there are some commented projects as well. ",
  "linkedin-describe":"Here it contains some information in the professional field,<br> the companies that I have worked with, some knowledge that I have, <br> the connections with people, and articles that I have already done.",
  "stackoverflow-describe":"Here it contains some questions and answers that <br> I have already made about coding and other related issues <br> to the various languages ​​in which I have already used it.",


  "_comment_OUTROS": "OTHERS",
  "git-describe1": "I have several projects in the Git Hub;",
  "git-describe2": "I've worked on a large project using gitBlit for versioning;",
  "git-describe3": "All projects were using command line.",

  "maven-describe1": "All my Java projects, I use the Maven tool;",
  "maven-describe2": "I use Maven to manage and drop dependencies;",
  "maven-describe3": "I also use it to manage plugins.",

  "jasper-describe1": "I used Jasper to create reports;",
  "jasper-describe2": "I have already created several reports and sub-reports;",
  "jasper-describe3": "I created with export to excel, word and PDF.",

  "_comment_SERVER": "SERVER",
  "jboss-describe1": "I use Wildfly as an application server;",
  "jboss-describe2": "I've worked on a long project with Wildfly;",
  "jboss-describe3": "I have knowledge about the standalone file, the wars boot, and others.",

  "apache-describe1": "I used Tomcat in my final course completion work;",
  "apache-describe2": "I use Tomcat for small projects that can be seen on my gitHub.",
  "apache-describe3": "I use a lot of Spring Boot, which has built-in Tomcat.",

  "_comment_BANCO": "BANK",
  "sql-describe1": "I have worked with several systems on which I had to create scripts;",
  "sql-describe2": "I have done potions with MySql, Sql Server and PostgreSQL;",
  "sql-describe3": "I've already created Trigger, Job, Function, View ...",

  "nosql-describe1": "I have already used fireBase as dataBase and applications.",

  "flyway-describe1": "I was already responsible for managing scripts, so use Flyway;",
  "flyway-describe2": "Implemented Flyway in a great project to optimize time and maintain versioning.",


  "_comment_FRONT-END": "FRONT-END",
  "java-info1": "I have the 1Z0-808 (Java SE 8 Programmer I);",
  "java-info2": "I have worked with several Java frameworks;",
  "java-info3": "I have already done several courses of the Java SE language and Java EE.",

  "spring-info1": "I have several projects with Spring;",
  "spring-info2": "I have already created projects with Spring boot;",
  "spring-info3": "I already used Spring Data;",
  "spring-info4": "I already used Spring Security;",
  "spring-info5": "I've already used Spring MVC.",

  "wicket-info1": "I have long experience with Wicket;",
  "wicket-info2": "I've worked on a large project using Wicket;",
  "wicket-info3": "I have created pages, panel and components.",

  "hibernate-info1": "I use Hibernate extensively to do entity mapping;",
  "hibernate-info2": "I have experience with relational mapping;",
  "hibernate-info3": "I have experience with HQL;",
  "hibernate-info4": "I have already used Hibernate Envers for auditing.",

  "html-describe1": "I have knowledge in HTML5;",
  "html-describe2": "I have already created several projects in which I had to use html;",
  "html-describe3": "I already used Thymeleaf and Apache Velocity as template engine, besides Wicket and JSF.",

  "css-describe1": "I have knowledge in CSS3;",
  "css-describe2": "I've already created media queries to ensure responsiveness.",

  "js-describe1": "I have already created several functions with Java Script;",
  "js-describe2": "I use enough Jquery to make it easier to use JS;",
  "js-describe3": "I've already used native Java Script functions to do business-like features.",

  "angular-describe1": "I have already taken a course of Angular JS;",
  "angular-describe2": "I have already done a project with Angular JS to practice;",
  "angular-describe3": "I have already created some projects with Angular (Angular 2);",
  "angular-describe4": "This site was made using Angular.",

  "bootstrap-describe1": "Most of my projects I use Bootstrap;",
  "bootstrap-describe2": "I know Bootstrap's grid system well;",
  "bootstrap-describe3": "This page was made with Bootstrap and Material design.",

  "_comment_MOBILE": "MOBILE",
  "ionic-describe1": "I have already created small projects using Ionic;",
  "ionic-describe2": "I'm studying Ionic because it's multiplatform;",
  "ionic-describe3": "I've done some courses with Ionic;",
  "ionic-describe4": "I have some knowledge in Angular and use it to create projects with Ionic.",

  "android-describe1": "I've done projects with pure android;",
  "android-describe2": "I've created some applications, but no professional."
}
